# Relational Database Coursework

**Author:** Gaoyuan Liang - H00353899

**Username:** jessica

Students have been supplied this skeleton notebook for completing their F21DF coursework.

This notebook makes use of the [IPython SQL magic](https://github.com/catherinedevlin/ipython-sql) developed by [Catherine Devlin's](http://catherinedevlin.blogspot.com/). Magics are a mechanism within Jupyter to achieve some specific feature within Python such as executing SQL commands over a database. An overview of magics can be found in the [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/01.03-magic-commands.html).

Students are required to complete all sections of this notebook and then submit it according to the supplied instructions.

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Connect-to-the-MACS-Database-Server" data-toc-modified-id="Connect-to-the-MACS-Database-Server-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Connect to the MACS Database Server</a></span></li><li><span><a href="#Database-Design-[10-Marks]" data-toc-modified-id="Database-Design-[10-Marks]-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Database Design [10 Marks]</a></span></li><li><span><a href="#Relational-Schema-[10-Marks]" data-toc-modified-id="Relational-Schema-[10-Marks]-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Relational Schema [10 Marks]</a></span></li><li><span><a href="#Loading-Data-[5-Marks]" data-toc-modified-id="Loading-Data-[5-Marks]-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Loading Data [5 Marks]</a></span></li><li><span><a href="#Querying-the-Database-[20-Marks]" data-toc-modified-id="Querying-the-Database-[20-Marks]-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Querying the Database [20 Marks]</a></span></li></ul></div>

## Connect to the MACS Database Server

If the following commands do not work, then refer to the lab notebooks used in the course.

In [1]:
# Load the SQL magics for jupyter
%load_ext sql

The following cell set the address for the MySQL database server to connect to. The default addess is for MySQL to be installed on the same machine, i.e. `localhost:3306`, as is the case on the MACS Linux VM. The MACS MySQL server address is `mysql-server-1.macs.hw.ac.uk:3306`.

In [2]:
# Set mysql server address
server = "localhost:3306"

In [3]:
# Establish connection to MACS Database Server
from getpass import getpass
username = 'jessica' #input('Enter your mysql username: ')
password = 'GDerit4758' #getpass(prompt='Enter your mysql password: ')
connection_string = "mysql+pymysql://{username}:{password}@{server}/{username}".format(username=username, password=password, server=server)
%sql $connection_string

## 1. Database Design [10 Marks]

**ToDo:** Provide the ER diagram for your database. Save your ER diagram in the same directory as this notebook as a png file with the filename `erDiagram.png`.

<img src="erDiagram.png" alt="Drawing" style="width: 600px;"/>

**ToDo:** Give a brief overview of your diagram detailing any design decisions made, and constraints that could not be captured.

## 2. Relational Schema [10 Marks]

**ToDo:** Using the following table template, provide the data dictionary for the relational schema you have generated from your ER diagram.

**Customer**

| Attribute | Description | Domain | Null? | Primary Key | Foreign Key
| --- | --- | --- | --- | --- | --- |
| Customer_email | Customer_email | text (100) | N | Y | N |
| full_name | full name | text (100) | Y | N | N |
| address | address | text (100) | Y | N | N |
|     street | street | text (100) | Y | N | N |
|     city | city | text (100) | Y | N | N |
|     country | country | text (100) | Y | N | N |
| gender | gender | text (100) | Y | N | N |

**Garment_Order**

| Attribute | Description | Domain | Null? | Primary Key | Foreign Key
| --- | --- | --- | --- | --- | --- |
| order_number | order_number | int | N | Y | N |
| received_date | full name | DATETIME | Y | N | N |
| total_price_paid | total_price_paid | double | Y | N | N |
| customer_email | customer_email | text (100) | N | N | Y |
| fulfilled_date | fulfilled_date | DATETIME | Y | N | N |

**Garment**

| Attribute | Description | Domain | Null? | Primary Key | Foreign Key
| --- | --- | --- | --- | --- | --- |
| Garment_ID | Garment_ID | int | N | Y | N |
| name | name | text (100) | Y | N | N |
| description | description | text (100) | Y | N | N |
| Garment_type | type | text (100) | Y | N | N |
| recommended_price | recommended_price | double | Y | N | N |
| size_abbreviation | size_abbreviation | text (100) | Y | N | Y |
| standard_size | standard_size | text (100) | Y | N | N |

**item**

| Attribute | Description | Domain | Null? | Primary Key | Foreign Key
| --- | --- | --- | --- | --- | --- |
| order_number | order_number | int | N | N | Y |
| Garment_ID | Garment_ID | int | N | N | Y |
| price_paid | price_paid | double | Y | N | N |

**colour**

| Attribute | Description | Domain | Null? | Primary Key | Foreign Key
| --- | --- | --- | --- | --- | --- |
| colour_ID | colour_ID | int | N | N | Y |
| color | color | text (100) | Y | N | N |

**has_color**

| Attribute | Description | Domain | Null? | Primary Key | Foreign Key
| --- | --- | --- | --- | --- | --- |
| colour_ID | colour_ID | int | N | N | Y |
| colour_ID | Garment_ID | int | N | N | Y |

## 3. Schema Implementation [10 Marks]

**ToDo:** For each table in your relational schema, give the SQL CREATE statement for the table in one cell and the insert statements in a separate cell. Use markdown cells to describe the table and give any design decisions.

drop all the tables if exist

In [4]:
%%sql
DROP TABLE IF EXISTS item;
DROP TABLE IF EXISTS has_color;
DROP TABLE IF EXISTS Garment_Order;

DROP TABLE IF EXISTS Customer;
DROP TABLE IF EXISTS Garment;
DROP TABLE IF EXISTS colour;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

create table of Customer and insert some data

In [5]:
%%sql
CREATE TABLE Customer (
Customer_email varchar(255) NOT NULL,
full_name varchar(255),
street varchar(255),
city varchar(255),
country varchar(255),
gender varchar(255),
PRIMARY KEY (Customer_email)
);

INSERT INTO Customer (Customer_email, full_name, street, city, country, gender)
VALUES ('jessica@sjdgkdns.com', 'Gaoyuan Jessica Liang', 'Hamdan Str', 'Abu Dhabi', 'UAE', 'Female');

INSERT INTO Customer (Customer_email, full_name, street, city, country, gender)
VALUES ('gsdg@sjdgkdns.com', 'Jgsnk Igrn', 'sdgsdg Str', 'Dubai', 'UAE', 'Male');

SELECT * FROM Customer;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
1 rows affected.
1 rows affected.
2 rows affected.

[('gsdg@sjdgkdns.com', 'Jgsnk Igrn', 'sdgsdg Str', 'Dubai', 'UAE', 'Male'),
 ('jessica@sjdgkdns.com', 'Gaoyuan Jessica Liang', 'Hamdan Str', 'Abu Dhabi', 'UAE', 'Female')]

create the table of Garment_Order

In [6]:
%%sql

CREATE TABLE Garment_Order (
order_number INT NOT NULL,
received_date DATE,
total_price_paid double,
customer_email varchar(255) NOT NULL,
fulfilled_date DATE,
PRIMARY KEY (order_number),
FOREIGN KEY (customer_email) REFERENCES Customer(customer_email)
);

INSERT INTO Garment_Order (order_number, received_date, total_price_paid, customer_email, fulfilled_date)
VALUES (1234, '2020-10-25', 345, 'jessica@sjdgkdns.com', '2020-10-25');

INSERT INTO Garment_Order (order_number, received_date, total_price_paid, customer_email, fulfilled_date)
VALUES (5678, '2020-9-1', 645, 'gsdg@sjdgkdns.com', '2020-9-20');

INSERT INTO Garment_Order (order_number, received_date, total_price_paid, customer_email, fulfilled_date)
VALUES (4563, '2020-9-1', 352, 'gsdg@sjdgkdns.com', '2020-9-3');
INSERT INTO Garment_Order (order_number, received_date, total_price_paid, customer_email)
VALUES (5876, '2020-9-25', 644, 'gsdg@sjdgkdns.com');

SELECT * FROM Garment_Order;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.

[(1234, datetime.date(2020, 10, 25), 345.0, 'jessica@sjdgkdns.com', datetime.date(2020, 10, 25)),
 (4563, datetime.date(2020, 9, 1), 352.0, 'gsdg@sjdgkdns.com', datetime.date(2020, 9, 3)),
 (5678, datetime.date(2020, 9, 1), 645.0, 'gsdg@sjdgkdns.com', datetime.date(2020, 9, 20)),
 (5876, datetime.date(2020, 9, 25), 644.0, 'gsdg@sjdgkdns.com', None)]

create table of Garment, color, and has_color, and insert some data
for the question of available in 5 or more colours.

In [7]:
%%sql

CREATE TABLE Garment (
Garment_ID INT NOT NULL,
name varchar(255),
description varchar(255),
Garment_type varchar(255),
recommended_price double,
size_abbreviation varchar(255),
standard_size double,
PRIMARY KEY (Garment_ID)
);

INSERT INTO Garment (Garment_ID, name, Garment_type, recommended_price) 
VALUES (1, 'Jessica shirt', 'shirt', 234);
INSERT INTO Garment (Garment_ID, name, Garment_type, recommended_price) 
VALUES (2, 'Jessica trouser', 'trouser', 465);
INSERT INTO Garment (Garment_ID, name, Garment_type, recommended_price) 
VALUES (3, 'Jessica skirt', 'skirt', 867);

select * from Garment;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
3 rows affected.

[(1, 'Jessica shirt', None, 'shirt', 234.0, None, None),
 (2, 'Jessica trouser', None, 'trouser', 465.0, None, None),
 (3, 'Jessica skirt', None, 'skirt', 867.0, None, None)]

In [8]:
%%sql

CREATE TABLE colour (
colour_ID INT NOT NULL,
color varchar(255),
PRIMARY KEY (colour_ID)
);

INSERT INTO colour (colour_ID, color) VALUES (1, 'red');
INSERT INTO colour (colour_ID, color) VALUES (2, 'green');
INSERT INTO colour (colour_ID, color) VALUES (3, 'blue');
INSERT INTO colour (colour_ID, color) VALUES (4, 'gray');
INSERT INTO colour (colour_ID, color) VALUES (5, 'white');

select * from colour;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[(1, 'red'), (2, 'green'), (3, 'blue'), (4, 'gray'), (5, 'white')]

In [9]:
%%sql

CREATE TABLE has_color (
colour_ID INT NOT NULL,
Garment_ID INT NOT NULL,
FOREIGN KEY (colour_ID) REFERENCES colour(colour_ID),
FOREIGN KEY (Garment_ID) REFERENCES Garment(Garment_ID)
);

INSERT INTO has_color (colour_ID, Garment_ID) VALUES (1, 1);
INSERT INTO has_color (colour_ID, Garment_ID) VALUES (2, 1);
INSERT INTO has_color (colour_ID, Garment_ID) VALUES (3, 1);
INSERT INTO has_color (colour_ID, Garment_ID) VALUES (4, 1);
INSERT INTO has_color (colour_ID, Garment_ID) VALUES (5, 1);

select * from has_color;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[(1, 1), (2, 1), (3, 1), (4, 1), (5, 1)]

build the table of item and insert some data 
for question of order numbers of orders that do not contain trousers.

In [10]:
%%sql

CREATE TABLE item (
order_number INT NOT NULL,
Garment_ID INT NOT NULL,
price_paid DOUBLE,
FOREIGN KEY (order_number) REFERENCES Garment_Order(order_number),
FOREIGN KEY (Garment_ID) REFERENCES Garment(Garment_ID)
);

INSERT INTO item (order_number, Garment_ID)
VALUES (4563, 1);
INSERT INTO item (order_number, Garment_ID)
VALUES (4563, 3);

INSERT INTO item (order_number, Garment_ID)
VALUES (5876, 2);

select * from item;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
3 rows affected.

[(4563, 1, None), (4563, 3, None), (5876, 2, None)]

## 4. Querying the Database [20 Marks]
Populate each of the cells below with the required SQL query.

### a. Provide the name and email of all customers who have an unfulfilled order.

In [11]:
%%sql

SELECT DISTINCT Customer.full_name, Customer.customer_email
FROM Garment_Order 
LEFT JOIN Customer ON Customer.customer_email = Garment_Order.customer_email
WHERE fulfilled_date IS NULL

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[('Jgsnk Igrn', 'gsdg@sjdgkdns.com')]

### b. Give the names of garments that are available in 5 or more colours.

In [12]:
%%sql

SELECT Garment.name, COUNT(has_color.colour_ID) AS available_colours
FROM has_color
LEFT JOIN Garment ON Garment.Garment_ID = has_color.Garment_ID
GROUP BY has_color.Garment_ID

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[('Jessica shirt', 5)]

### c. Provide the order numbers of orders that do not contain trousers.

In [13]:
%%sql

select count(distinct item.order_number) as order_numbers_not_contain_trousers
from item 
left join Garment on Garment.Garment_ID = item.Garment_ID
where Garment_type != 'trouser'

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[(1,)]

### d. What was the total income from orders received on 1 September 2020?

In [14]:
%%sql

select sum(total_price_paid) as total_income
from Garment_Order where received_date = '2020-09-01'

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[(997.0,)]

### e. Of the fulfilled orders, what is the name of the customer(s) who had to wait the longest?

In [15]:
%%sql

select 
Customer.full_name,
fulfilled_date - received_date as wait_days 
from Garment_Order
left join Customer on Customer.customer_email = Garment_Order.customer_email
order by fulfilled_date - received_date desc
limit 1;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[('Jgsnk Igrn', 19)]